{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 3,
    "Custom": null,
    "Description": "When trying to load the sample project, VS complains that the SubsetFonts.targets cannot be found. The file seems to be missing. This error appears in changeset 20719.",
    "LastUpdatedDate": "2011-04-20T01:24:43.363-07:00",
    "PlannedForRelease": "GraphSharp v1.5",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "graphsharp",
    "ReportedDate": "2009-04-12T09:04:14.443-07:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "SubsetFonts.targets missing",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 3,
    "Id": 2707
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Can anybody repro this?  I haven't seen this problem, and am inclined to close the work item as not reproducible.",
      "PostedDate": "2009-10-07T02:17:33.237-07:00",
      "Id": 29771
    },
    {
      "Message": "I'm not a Graph # user.. but.. here's how I get a \"SubsetFonts.targets cannot be found\" error for my WPF project.\r\n\r\nI started development on this using Expression Blend 2.0 and VS 2008. \r\nEventually, my hard drive crashed and when it came time to re-install my software, Expression Blend 3.0 was available on my MSDN subscription.. so I installed Blend 3.0. \r\nWhen Blend 3.0 encountered my WPF solution, it kept prompting me with a pop-up.. something about \"do I want to upgrade the fonts\" and to be careful to back-up my solution because the upgrade could not be rolled back.\r\nI kept saying \"no\" to Blend's requests and had no problems for the longest time....   until I finally gave in and allowed it to do the upgrade. \r\n\r\nNow, my solution doesn't compile in VS 2008, and the main executable project won't even load up in Blend 3.0",
      "PostedDate": "2010-02-25T06:17:47.847-08:00",
      "Id": 29772
    },
    {
      "Message": "Can you repro this? not -> close this work item",
      "PostedDate": "2011-04-20T01:24:43.363-07:00",
      "Id": 34498
    }
  ]
}