[
  {
    "Id": "461619",
    "ThreadId": "217852",
    "Html": "When I try out the Sample-application which comes with the source-code the compound graphs are displaying the edges offset:ed / displaced.\r\n\r\nIs there a solution available for this?\r\n\r\nKind regards\r\nRichard",
    "PostedDate": "2010-06-30T05:44:45.533-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "461678",
    "ThreadId": "217852",
    "Html": "Once again. An answer to my own question... =O)\r\n\r\nIt seems like the example is generating a compound graph that doesn't display correctly. However when I manually add vertices and edges according to my requirements (no compounds in compounds) no edge problem seems occur.\r\n\r\nA snag though is that the edge shoots off if I try to drag a vertex inside a compound where that vertex is the only child in that compound. My hack-solution is to disable dragging for any single child-item by attaching a global / class MouseDown-listener to the VertexControl-type and execute the following code:\r\n\r\nVertexControl vc= sender as VertexControl;\r\nPocVertex parent = graph.GetParent(vc.Vertex as PocVertex);\r\nif(parent != null && graph.GetChildrenCount(parent) &lt; 2)\r\n  e.Handled = true;\r\n\r\nKind regards,\r\nRichard",
    "PostedDate": "2010-06-30T07:48:31.083-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "464119",
    "ThreadId": "217852",
    "Html": "Ok - so the problem reoccurs when the number of nodes / compound nodes are many.\r\n\r\nI would really like to have the CompoundFDP algorithm corrected...it's kind of a showstopper here...\r\nIt seems that any combination of parent / child vertices that amounts to about 190 vertices fails (not always though).\r\n\r\nWhy.....Do I need to set / change any layout-parameters?\r\n\r\nKind Regards\r\nRichard",
    "PostedDate": "2010-07-07T01:25:01.563-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "464809",
    "ThreadId": "217852",
    "Html": "This is an extreme hack but seems to resolve the issue with a large number of nodes / compound nodes.\r\nThe animation dissappears though but we need to move on so this &quot;solution&quot; have to do for now.\r\n\r\nIn GraphSharp.Controls.CompoundVertexControl.OnPositionChanged I commented out the entire block of code in the else case (when compoundVertexControl != args.OriginalSource).\r\nResult: The nodes are layed out correctly and animated when the number of items are few. When the total number of nodes are large (above 200) the nodes are layed out correctly but no animation is done to get there.\r\n\r\nKind regards\r\nRichard",
    "PostedDate": "2010-07-08T06:06:49.623-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]