[
  {
    "Id": "633711",
    "ThreadId": "262979",
    "Html": "\r\n<p>Hi,</p>\r\n<p>First, &nbsp;I like to thank you for writing this excellent graph layout API.</p>\r\n<p>I am willing to extend this graph sharp API to support &nbsp;multi-touch interaction in win 7 touch based devices like microsoft surface or other &nbsp;windows 7 based touch devices.</p>\r\n<p>I am wondering what will be a good place to start with.. do i need to rewrite all the layout generation code to support&nbsp;mufti-touch interaction [selecting multiple nodes or area in a layout&nbsp;using&nbsp;hand gesture]</p>\r\n<p>Any suggestion to start with will be highly appreciated.</p>\r\n<p>&nbsp;</p>\r\n<p>Thank you very much for your time.</p>\r\n<p>~Md. Zabedul Akbar</p>\r\n<p>Graduate student, University of Calgary.</p>\r\n",
    "PostedDate": "2011-06-27T12:25:24.957-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "648190",
    "ThreadId": "262979",
    "Html": "<p>Hi</p>\r\n<p>I'm also working on improving graph layout with multi-touch capabilities, I do not now exactly which place to start with, but just you tı have an idea,</p>\r\n<p>I just added graph sharp as a referance to my project and I added TouchUp TouchDown TouchMove etc to my xaml file and write the methods for my project.</p>\r\n<p>I do not know will it help to you but just to mention you.</p>\r\n<p>&nbsp;</p>\r\n<p>Good luck</p>",
    "PostedDate": "2011-07-27T03:26:25.287-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "648322",
    "ThreadId": "262979",
    "Html": "<p>Hi,</p>\r\n<p>Thank you very much for your reply. I need multi-touch interaction support for some of the layout in graph-sharp and wondering writing an API [or having one] for that will be really great.&nbsp;</p>\r\n<p>As we have some common interest, if you agree we can work together on extending multi-touch support for&nbsp;graph sharp.</p>\r\n<p>If you let me know your progress so far we can create a project in codeplex and start from there.</p>\r\n<p>You can also contact me via skype (zabed.akbar) or gmail (zabed.akbar).</p>\r\n<p>&nbsp;</p>\r\n<p>Have a nice day.</p>\r\n<p>&nbsp;</p>\r\n<p>~Zabed</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2011-07-27T07:54:06.89-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]