[
  {
    "Id": "203893",
    "ThreadId": "60221",
    "Html": "<p>I'm having some trouble with getting DataTemplates to work.&nbsp; The code I'm trying to get this working in is possibly a little strange:</p>\r\n<p>The class I'm using as my Vertices is in a dynamically loaded assembly.&nbsp; All vertices implement an interface (IEntity) which is in the local assembly.</p>\r\n<p>I've tried adding a DataTemplate with DataType=&quot;{x:Type pluginmodel:IEntity}&quot; in Window.Resources (I think that's how it's done in the sample...) but this doesn't seem to work for me.</p>\r\n<p>&nbsp;</p>\r\n<p>Am I trying to do things the right way?&nbsp; Would it help if I used a wrapper class in the local assembly to hold my IEntity objects?</p>\r\n<p>Thanks</p>",
    "PostedDate": "2009-06-21T17:56:27.487-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "203942",
    "ThreadId": "60221",
    "Html": "<p>Don't worry - it was my mistake.&nbsp; DataTemplates don't support interfaces.&nbsp; I created a wrapper UserControl, and this shows up without needing to use a DataTemplate.</p>\r\n<p>&nbsp;</p>\r\n<p>I would appreciate it if someone could let me know if I was barking up the right tree though?</p>\r\n<p>(Ie, would this have worked if it wasn't for the Interface issue?)</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks for writing the graphing layout library I've been searching for since 2006 :)</p>",
    "PostedDate": "2009-06-22T00:01:29.827-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "487614",
    "ThreadId": "60221",
    "Html": "<p>@bgreene Would you post your code so that others can benefit from your work?</p>",
    "PostedDate": "2010-09-01T07:40:15.73-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "493588",
    "ThreadId": "60221",
    "Html": "<p>Yes, I agree - I'd very much like to see how you added a custom UserControl for different types of entities.</p>\r\n<p>Thank you!</p>",
    "PostedDate": "2010-09-14T17:21:58.583-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]